; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	infrared2 - mode
	Star5 - direction
	Star3 - direction
	Star1 - direction
	Star4 - direction
	GroundStation0 - direction
	Star2 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star1)
	(supports instrument6 infrared2)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared2)
	(supports instrument8 spectrograph1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument9 infrared2)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star2)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(have_image Star6 thermograph0)
	(have_image Phenomenon7 thermograph0)
	(have_image Star8 thermograph0)
	(have_image Planet9 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Star12 thermograph0)
	(have_image Star13 infrared2)
))

)

; plan
1. (turn_to satellite0 star2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star2)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 star11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star11)
   goals met: 0 of 8
5. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 1 of 8
7. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 2 of 8
8. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 2 of 8
9. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon7 instrument0 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 4 of 8
12. (turn_to satellite0 star12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star12)
   goals met: 4 of 8
13. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 5 of 8
14. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 5 of 8
15. (take_image satellite0 star13 instrument0 infrared2)
   added: (have_image star13 infrared2)
   goals met: 6 of 8
16. (turn_to satellite0 star6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star6)
   goals met: 6 of 8
17. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 7 of 8
18. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
19. (take_image satellite0 star8 instrument0 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 8 of 8
